app/controllers/entries_controller.rb

SELECT "entries".* FROM "entries"  ORDER BY created_at DESC
---
  def index
    render :json => Entry.all

SELECT  "entries".* FROM "entries" WHERE "entries"."id" = $1 LIMIT 1  [["id", 1]]
---
  def show
    render :json => Entry.find(params[:id])

INSERT INTO "entries" ("name", "number", "email", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create
    form = EntryForm.new Entry.new

    if form.validate params[:entry]
      form.save

SELECT  "entries".* FROM "entries" WHERE "entries"."id" = $1 LIMIT 1  [["id", 11]]
UPDATE "entries" SET "name" = $1, "number" = $2, "description" = $3, "updated_at" = $4 WHERE "entries"."id" = $5  [["name", "Edited Sample Entry"], ["number", "00012345566"], ["description", "Lorem"], ["updated_at", "2015-10-27 04:08:29.143401"], ["id", 11]]
---
  def update
    form = EntryForm.new Entry.find(params[:id])

    if form.validate params[:entry]
      form.save

SELECT  "entries".* FROM "entries" WHERE "entries"."id" = $1 LIMIT 1  [["id", 11]]
DELETE FROM "entries" WHERE "entries"."id" = $1  [["id", 11]]
---
  def destroy
    entry = Entry.find params[:id]
    entry.destroy